extends Resource
class_name UpgradeLibrary


static var skill_names = [
	["青龙之眼","充足木料","穿甲箭","苍龙之箭","破伤风箭头"],
	["远程指挥","强健体魄","精良装备","高效训练","顽强"],
	["法术感应","唯心攻击","魔法腐蚀","魔法诅咒","闪耀魔法水晶"],
	["高级望远镜","精炼火药","成熟产业链","秘制炸药","共振"],
	["天火","焦土作战","超级天灾","人间炼狱","壮丽陨石雨"],
	["完善后勤体系","装备升级","侦察兵装备","骑士装备","破灭者"]
]


static var skill_intros = [
	[
		"弓箭手的视力得到强化，提高箭塔的攻击范围。", #提高15%
		"开战前备好充足的建筑木料，降低箭塔的基础建造费用。", #降低10绿宝石
		"每次攻击小概率射出特制箭头，无视对方护甲。", #15%概率
		"每次攻击都有微小概率借助苍龙之力提高射出的箭矢伤害。", #18%概率双倍伤害
		"箭矢被附上了独特的破伤风附魔，每次攻击都有概率让敌人流血4s。" #10%概率，流血每0.5s造成当前伤害量的真实伤害
	],
	[
		"完善指挥网络，可以让士兵调往更远的地方。", #调集范围提高20%
		"为士兵引入严苛而又科学的训练方案，提高训练出的士兵的生命。", #提高20%生命
		"为士兵打造更加坚固的盔甲，能够更加有效地抵挡敌人的进攻。", #提高10%护甲
		"完善士兵的培养方案，可以更加快速地训练出新的士兵赶往战场战斗。", #降低20%训练时间
		"高素质的训练使得士兵培养出了强大的自愈能力，随时可以恢复伤势。" #无论是否参战，每秒恢复自身2%最大生命值
	],
	[
		"法师与自身法术的结合更加深厚，能够攻击到更远的敌人。", #提高10%
		"法师塔的攻击有可能改变现实，造成真实伤害。", #12%概率真伤
		"高能法术，强大的能量可以摧毁腐蚀敌人的装甲，失去护甲的保护。", #每次攻击永久削除敌人1护甲
		"为每次攻击注入诅咒，法师的攻击可以延缓敌人前进的脚步。", #减速40%，持续1s
		"闪耀着光芒的魔法水晶，能够给予法师更加强大的力量，放出更加致命的法术。" #提高15%攻击力
	],
	[
		"装备高级望远镜，可以让炮塔打击到更远范围的敌人。", #提高10%
		"增加火药原材料的纯度，提高发射炮弹的威力，全是科技与狠活。", #提高10%攻击力
		"构建完善的产业链体系，降低炮塔特殊技能的升级成本。", #降低20%
		"古法炮制的强力炸药，中华老字号，可以保证发射的炮弹不会产生伤害衰减。", #每次范围最大伤害
		"炮弹可以让敌人产生共振引发脑震荡，有概率眩晕敌人数秒。" #15%概率眩晕1s
	],
	[
		"额外召唤两个陨石，并提高火雨的基础伤害。",
		"协议通过，陨石砸下的地面将留下一片焦土，持续伤害经过的敌人。",
		"进一步提高火雨的基础伤害，并额外召唤一个陨石。",
		"协议时间增加，提高焦土造成的伤害，具有一定穿透性的同时还将提高留存时间。",
		"随机挑选两处幸运的地方额外砸下两颗陨石，提高陨石基础伤害并减少火雨的冷却时间10s。"
	],
	[
		"援军拥有更加完善的后勤体系，能够增加场上的支援时间。",
		"援军配备护甲，拥有更加强大的作战能力，能够更好地适应战斗环境。",
		"援军配备侦察兵装备，并追加远程攻击能力（侦察兵为什么会上战场）。",
		"援军配备最先进的骑士装备，全面强化作战能力，更大程度发挥支援效果。",
		"每次召唤援军时都可以把一个强大的破灭者拽过来，尽数踏破场上嚣张的敌人。"
	]
]

static var skill_prices = [
	[1,1,2,2,3],
	[1,1,2,2,3],
	[1,2,2,3,3],
	[1,2,3,3,4],
	[2,2,3,3,4],
	[1,2,3,3,4]
]
