extends Resource
class_name EnemyLibrary

static var enemy_datas: Array[EnemyData] = [
	#0
	EnemyData.new("尸国杂兵","尸国的炮灰级先锋军，没有任何特殊能力。",
	20,2,4,0,0,1.1,1,
	"-低生命值\n-中速"),
	
	#1
	EnemyData.new("尸国皮甲兵","穿戴皮甲的匕首兵，通常是军队中的先锋部队。",
	80,5,10,0.2,0,1,1,
	"-低护甲\n-中速"),
	
	#2
	EnemyData.new("尸国小鬼","狡猾的尸国童子军，能够快速突破防线。",
	20,1,2,0,0,1.8,1,
	"-低生命值\n-快速"),
	
	#3
	EnemyData.new("鸡骑士","这些狡猾的小鬼骑乘着小鸡快速越过防线，死后依旧可以继续前进。",
	10,0,0,0,0,2.4,1,
	"-快速\n-死后生成尸国小鬼\n-无法拦截","#无法拦截；死后离开坐骑"),
	
	#4
	EnemyData.new("尸国正规军","尸国的正规军队，比起杂兵拥有更加精良的装备。",
	150,8,16,0.4,0,0.8,1,
	"-中速\n-中等护甲"),
	
	#5
	EnemyData.new("尸国壮汉","尸国强悍的精英兵种，一夫可匹敌万人，所到之处皆为废墟瓦砾。",
	860,30,50,0,0,0.6,3,
	"-高生命值\n-移速慢\n-损失3点生命值"),
	
	#6
	EnemyData.new("尸国刺杀者","这些刺客狡诈而迅速，作为突袭部队能够快速抹杀敌人，为后方部队铺平道路。",
	60,32,64,0.3,0,1.8,1,
	"-低护甲\n-移速快\n-高伤害\n-概率闪避近战伤害","#闪避近战伤害"),
	
	#7
	EnemyData.new("尸国贵族战士","作为贵族参与战争的战士，盔甲皆为纯金，在家中坐拥万贯财产。",
	500,12,24,0.4,0,0.8,2,
	"-真实伤害\n-中等护甲\n-损失2点生命值","#真实伤害；二段攻击"),
	
	#8
	EnemyData.new("骨国步兵","来自骨国的普通步兵，没有特殊能力。",
	100,5,8,0,0,0.9,1,
	"-中等移速\n-生命平均"),
	
	#9
	EnemyData.new("骨国正规军","骨国的正规军队，卑鄙无比，能够在远处射杀敌人。",
	120,5,8,0,0.4,0.9,1,
	"-中等魔法抗性\n-远程攻击","#远程攻击"),
##==========================================================================
	
	#10
	EnemyData.new("野区丧尸","无意识，野区常见的怪物，渴望受害者的大脑。",
	80,4,8,0,0,0.6,1,
	"-慢速\n-撕咬","#撕咬"),
	
	#11
	EnemyData.new("溺尸","被诅咒的丧尸，以重获新生的姿态继续游荡。",
	160,8,16,0,0.6,0.6,1,
	"-慢速\n-中等魔法抗性"),
	
	#12
	EnemyData.new("溺尸斗士","疑似进化出智慧的野区生物，会使用三叉戟作为武器。",
	350,15,30,0.3,0,1,1,
	"-低护甲\n-激流打击\n-投掷三叉戟","#激流打击；远程攻击"),
	
	#13
	EnemyData.new("腐化爬行者","疾速、危险的野区生物，一旦有活物靠近就会立即爆炸。",
	70,0,0,0,0.4,2,1,
	"-快速\n-中魔法抗性\n-自爆","#自爆"),
	
	#14
	EnemyData.new("腐化蜘蛛","行动迅速，狡猾的野区生物，利用毒牙与蛛丝进行狩猎。",
	60,1,3,0,0.6,1.6,1,
	"-快速\n-中魔法抗性"),
	
	#15
	EnemyData.new("终末","一种高大、危险的生物，据说诞生自末日，可轻松回避任何攻击。",
	780,26,48,0,0.7,0.6,2,
	"-高魔法抗性\n-闪避伤害\n-瞬移","#闪避伤害；瞬移"),
	
	#16
	EnemyData.new("丧尸野狼","这群潜伏于丛林野区的怪物奔袭速度极快，锋利的獠牙可以轻松撕开血肉与盔甲。",
	120,24,36,0,0.7,2.5,1,
	"-快速\n-高魔法抗性\n-闪避近战伤害","#闪避近战伤害"),
	
	#17
	EnemyData.new("丛林幻翼","狡猾的生物，诞生自不眠，可轻松穿过森严的防线。",
	100,0,0,0,0,1.2,1,
	"-飞行","#飞行"),
	
	#18
	EnemyData.new("腐朽","诞生自黑暗的丧尸，只服从于黑暗法师的命令。",
	140,10,20,0,0.3,0.5,1,
	"-扑咬\n-低魔法抗性\n-慢速","#扑咬"),
##================================================================

	#19
	EnemyData.new("尸壳","沙漠中的怪物，会通过撕咬感染猎物。",
	160,10,15,0,0,0.6,1,
	"-慢速\n-饥饿攻击","#饥饿攻击"),
	
	#20
	EnemyData.new("尸壳勇士","疑似开智的沙漠怪物，皮糙肉厚，会手持原始武器冲锋在前进行狩猎。",
	320,16,24,0.2,0,1,1,
	"-低护甲\n-饥饿攻击","#饥饿攻击"),
	
	#21
	EnemyData.new("沙漠狙击手","游荡在沙漠的怨魂空骸，生前曾是沙漠部族最英勇的战士，可以百步穿杨。",
	150,8,12,0,0,0.6,1,
	"-超远程狙击\n-慢速","#远程攻击"),
	
	#22
	EnemyData.new("蠹虫","不要小瞧这些看似弱小的虫型生物，它们狩猎时常成群结队，即使是最有经验的沙漠旅人也不敢大意。",
	50,6,10,0,0,1.2,1,
	"-中等移速\n-呼唤同伴","#呼唤同伴"),
	
	#23
	EnemyData.new("噩梦幻翼","沙漠中诞生自噩梦的飞行怪物，更加难以对付。",
	250,0,0,0,0.3,0.9,1,
	"-飞行\n-低魔法抗性","#飞行"),
	
	#24
	EnemyData.new("沙漠守卫","原是神庙内的泥像，在入侵者闯入后会立刻出动，保卫神庙和内部的失落宝藏。",
	230,10,15,0.5,0,1.1,1,
	"-中等移速\n-中等护甲"),
	
	#25
	EnemyData.new("木乃伊","沉睡于神庙内的干尸，现因不明原因苏醒了过来，势要吞食残余的生灵。",
	400,12,18,0,0,0.7,1,
	"-慢速\n-吸血攻击\n-剧毒攻击","#剧毒攻击；吸血攻击"),
	
	#26
	EnemyData.new("黄金傀儡","坚硬、不屈的傀儡，是神庙应对闯入者的最终手段，一击便可清理大批敌人。",
	1800,50,100,0.4,0,0.5,5,
	"-超高生命值\n-慢速\n-中等护甲\n-损失5点生命值\n-范围伤害","#范围伤害"),
	
	#27
	EnemyData.new("沙漠雇佣兵","强悍的雇佣兵，没有是非观念，只服从于自己的雇主。",
	200,24,48,0.15,0,1.2,1,
	"-低护甲\n-高伤害"),
	
	#28
	EnemyData.new("军火商","沙漠中的走私犯，财产无数，擅于收买人心。",
	400,2,4,0,0.7,0.5,3,
	"-收买士兵\n-召唤雇佣兵\n-高魔法抗性\n-损失3点生命值","#收买士兵；召唤雇佣兵"),

##=============================================================================================

	#29
	EnemyData.new("厌国战士","强大的战士，以铁拳和炸弹作为武器。",
	200,7,12,0.5,0,1.2,1,
	"-中护甲\n-投掷炸弹\n-死亡自爆","#远程攻击；死亡自爆"),
	
	#30
	EnemyData.new("厌国精英","强悍无比、全副武装的精锐士兵，会战斗到生命的最后一刻。",
	640,21,36,0.7,0,0.9,1,
	"-中等速度\n-重甲单位\n-死亡自爆","#死亡自爆"),
	
	#31
	EnemyData.new("苦力怕","体内装满炸药，装备超自然武器的危险生物，能够发射致命光束。",
	420,10,18,0,0.8,1.2,1,
	"-远程发射致命光弹\n-高魔法抗性\n-死亡自爆","#远程攻击；死亡自爆"),
	
	#32
	EnemyData.new("厌国狂战士","无法阻挡的凶猛怪物，手中的量子光刃可以锯开哪怕最坚硬的钢铁，所过之处皆为血肉烂泥。",
	3650,120,170,0.4,0,0.4,5,
	"-极其强悍\n-极高范围真实伤害\n-损失5点生命值\n-死亡自爆\n-慢速","#范围真实伤害；死亡自爆；双重量子光刃"),
	
	#33
	EnemyData.new("劫掠者","手持弓弩，受过专业训练的精英士兵，一击便可精准射中敌人要害之处。",
	350,6,14,0.2,0,1.2,1,
	"-低护甲\n-远程攻击","#远程攻击"),
	
	#34
	EnemyData.new("卫道士","手持巨斧，不可阻挡的杀人狂魔，哪怕是最勇敢的士兵在其利斧面前都会止不住战栗。",
	600,70,90,0.4,0,0.8,1,
	"-中等护甲\n-高伤害"),
	
	#35
	EnemyData.new("劫掠者队长","担任要职的刌民头头，会鼓舞友军，大幅提升他们的作战能力。",
	1040,12,16,0.4,0,0.7,2,
	"-中护甲\n-远程攻击\n-鼓舞队友\n-损失2点生命值","#远程攻击；鼓舞队友"),
	
	#36
	EnemyData.new("唤魔者","掌控邪恶巫术的刌民，可以召唤来自深渊的恶魔，自身对邪恶巫术长期的沾染使得他们不会畏惧任何魔法。",
	560,50,60,0,0.95,0.5,1,
	"-极高魔法抗性\n-召唤尖牙攻击\n-召唤恼鬼","#召唤尖牙攻击；召唤恼鬼"),
	
	#37
	EnemyData.new("女巫","这些魔法狂徒狂热地钻研各种法术与药水知识，精通各种邪门巫术。",
	600,10,16,0,0.9,0.5,1,
	"-高魔法抗性\n-饮用治疗药水\n-对我方单位投掷负面喷溅药水\n-对友军投掷增益喷溅药水","#远程攻击；饮用治疗药水；投掷喷溅药水"),
	
	#38
	EnemyData.new("劫掠兽","刌民驯化的强悍作战猛兽，可以冲锋摧毁沿途的一切生灵。",
	2200,60,120,0,0,0.4,4,
	"-范围伤害\n-冲锋\n-损失4点生命值","#范围伤害；冲锋"),
	
	#39
	EnemyData.new("史莱姆","沼泽地带的奇特生物，死亡后可以分裂成更小的形态继续前进。",
	1200,10,20,0,0,0.4,3,
	"-死亡分裂\n-小史莱姆不可阻挡","#死亡分裂"),
	
	#40
	EnemyData.new("幻翼","神秘帝国空军部队，盘旋在高空随时做好空袭准备。",
	400,0,0,0,0,1,1,
	"-飞行","#飞行"),
	
	#41
	EnemyData.new("蜘蛛","不同于野区的无智怪物，这些快速突进部队神出鬼没，更难对付。",
	230,8,21,0,0.8,2,1,
	"-高魔法抗性\n-攻击造成真实伤害","#真实伤害"),
	
	#42
	EnemyData.new("恼鬼","体型小巧且异常狡猾的飞行恶魔，来自深渊，会袭击地上的目标。",
	80,0,0,0,0.4,1,1,
	"-飞行\n-俯冲攻击","#飞行；俯冲攻击"),
	
	#43
	EnemyData.new("泰坦威克斯","来自深渊的危险生物，可以短暂飞行绕过防线。",
	1600,35,60,0,0,0.6,3,
	"-非常强悍\n-能够短暂飞行\n-损失3点生命值","#短暂飞行"),
	
	#44
	EnemyData.new("守卫者","它们是海洋霸主的忠实护卫者，能从眼中射出致命的光束。",
	1800,30,60,0,0.5,0.7,5,
	"-范围伤害\n-中魔法抗性\n-损失5点生命值\n-远程攻击\n-精英敌人","#游泳；范围伤害；远程攻击"),
##===============================================================================================

	#45
	EnemyData.new("白眼士兵","神秘的无畏士兵，身体强壮，自发地抵抗外来的入侵者。",
	300,10,20,0,0,1.2,1,
	"-免疫负面状态","#免疫负面状态"),
	
	#46
	EnemyData.new("白眼勇士","装备精良，更加专业的无畏士兵，是神秘部落的中坚力量。",
	580,17,34,0.3,0,1,1,
	"-低护甲\n-免疫负面状态","#免疫负面状态"),
	
	#47
	EnemyData.new("白眼法师","强大、令人生畏的施法者，释放的神秘法术可以快速治愈友军的伤口。",
	760,10,12,0,0.7,0.5,1,
	"-免疫负面状态\n-远程攻击\n-恢复光环\n-高魔法抗性","#免疫负面状态；远程攻击；恢复光环"),
	
	#48
	EnemyData.new("白眼傀儡","高大、无意识的巨型傀儡，恐怖的战争机器，只会向前移动并碾碎道路上的一切。",
	1000,50,100,0,0,0.5,2,
	"-免疫负面状态\n-高生命值\n-范围伤害","#免疫负面状态；范围伤害"),
##=============================================================================================

	#49
	EnemyData.new("尸壳斗剑士","尸皇的皇家近卫军，从沙漠地带历练归来，其强大的力量令无数战士望尘莫及。",
	2500,34,51,0.4,0,0.6,5,
	"-极其强悍\n-范围伤害\n-饥饿攻击\n-损失5点生命值","#范围伤害；饥饿攻击"),
	
	#50
	EnemyData.new("剧毒蜘蛛","蜘蛛中的精锐部队，这些看似弱小的蜘蛛凶狠无比，藏有能腐蚀万物的剧烈毒素。",
	200,60,80,0,0.9,2.4,1,
	"-快速\n-高魔法抗性\n-致命毒素","致命毒素"),
	
	#51
	EnemyData.new("荆棘射手","穿有附魔盔甲，受到魔法双重保护的精英射手，骨国最优秀的射手，可以反弹受到的伤害。",
	800,10,30,0.4,0.8,1.1,1,
	"-中护甲\n-高魔法抗性\n-远程攻击\n-能够反弹所受伤害","#远程攻击；荆棘反甲"),
	
	#52
	EnemyData.new("苦族投弹手","翱翔于天际的霸主，对地面上的所有有生力量进行地毯式轰炸。",
	250,30,50,0.5,0,1,2,
	"-飞行\n-中护甲\n-损失2点生命值\n-投掷炸弹\n-死亡生成幻翼","#飞行；远程攻击；死亡生成幻翼"),
	
	#53
	EnemyData.new("戮","实验催生的可怕怪物，只懂得杀戮沿途的一切生灵。",
	1000,30,50,0,0,2,2,
	"-快速\n-高生命值\n-范围伤害\n-有概率秒杀士兵","#范围伤害；概率秒杀"),
##==========================================================================================

	#54
	EnemyData.new("尸国统帅","尸国最强悍的战士，自诩“世界的战士”，全副武装几乎刀枪不入，阻挡者皆为死路一条。",
	4000,24,76,0.85,0,0.5,20,
	"","#BOSS"),
	
	#55
	EnemyData.new("泰坦丧尸","一种高大威猛的巨型生物，一声怒吼天地为之颤动，从没有人能在见过他之后活着离开。",
	7200,150,250,0,0,0.4,20,
	"","#BOSS"),
	
	#56
	EnemyData.new("巨型尸壳","诞生自沙漠，只存在于传说中的可怕生物，同时也是整片沙漠大陆的统治者，沙漠王国真正的主人。",
	12000,300,500,0,0,0.4,20,
	"","#BOSS"),
	
	#57
	EnemyData.new("远古守卫者","领海的霸主，整片海洋的统治者，它的每次阖眼都意味着世界某处的狂风巨浪。",
	8000,500,800,0,0.8,0,20,
	"","#BOSS"),
	
	#58
	EnemyData.new("LIVER","手持巨剑的强大战士，白眼部族的统治者，拥有未知的力量。",
	9000,300,400,0,0,0.8,20,
	"","#BOSS"),
	
	#59
	EnemyData.new("厌皇尼古拉斯","手握雷霆之力，厌国的统治者，机缘巧合之下掌控了失落的力量，拥有了毁天灭地的力量。",
	8000,600,900,0,0,0.5,20,
	"","#BOSS")
##======================================================================================================
]


##==============================================
